'use client';

import BackLink from "@/components/ui/back-link";
import PageTitle from "@/components/ui/page-title";

export default function TermsPage() {
    const terms = [
        {
            title: "مقدمة",
            content: "تهدف بارق لإيجاد بيئة آمنة تضمن للمستخدمين حقوقهم وتساعد الأكاديميين على إيجاد مشاريع ينفذونها وتساعد أصحاب المشاريع على إيجاد أكاديميين محترفين ينفذون أعمالهم المختلفة. لتحقيق ذلك، نرجو من المستخدمين الكرام الالتزام بالشروط التالية وفهمها جيداً. إن لم تكن موافقاً على أي من الشروط التالية، نرجو ألا تستخدم موقع بارق وألا تنشئ حساباً به. باستخدامك لموقع بارق أنت تقر على موافقتك الكاملة على هذه الشروط."
        },
        {
            title: "صحة المعلومات",
            content: "يضمن المستخدم أن جميع المعلومات التي يقوم بإضافتها في حسابه في بارق صحيحة تماما، ويتحمل المستخدم كامل المسؤولية عن أي معلومات خاطئة يقوم بإضافتها."
        },
        {
            title: "الحسابات",
            content: "يلتزم المستخدم بعدم إنشاء أكثر من حساب واحد في بارق، وفي حال واجه مشكلة في حسابه الأول فعليه المتابعة مع فريق بارق لحل المشكلة. يتعهد المستخدم المسجل في بارق أنه الوحيد الذي يستخدم الحساب ويكون مسؤولا عن كل ما يتم عبر حسابه."
        },
        {
            title: "العمر والهوية",
            content: "يلتزم المستخدم المسجل في بارق أن عمره أكبر من 18 سنة، وقد يطلب بارق وثائق تثبت ذلك في حال دعت الحاجة. قد يطلب موقع بارق وثائق شخصية مثل الهوية أو جواز السفر لإثبات هوية المستخدم قبل السماح له بإكمال استخدام الموقع."
        },
        {
            title: "إيقاف الحساب",
            content: "بارق منصة تعليمية، قد يقوم فريق بارق بإيقاف حساب أي مستخدم يتم الشك فيه أو بمخالفته للشروط، ويحق للموقع طلب وثائق شخصية عن المستخدم تثبت هويته لإعادة تفعيل الحساب."
        },
        {
            title: "الملف الشخصي",
            content: "يجب أن يكون اسم المستخدم اسم له معنى وليس مجرد رموز أو أرقام. يلتزم المستخدم بوضع صورته الشخصية الحقيقية وعدم وضع صورة لشخص آخر ضمن حسابه. يجب أن تعبر النبذة الشخصية عن المستخدم ومؤهلاته الأكاديمية واختصاصه بشكل مختصر."
        },
        {
            title: "العمولة",
            content: "يتم اقتطاع عمولة منصة بارق من الأكاديمي وليس من صاحب المشروع، لايحق للأكاديمي أن يطلب من صاحب المشروع دفع عمولة بارق. عمولة بارق هي 15% فقط من اي صفقة تتم عبر المنصة."
        },
        {
            title: "تعليق الأرباح",
            content: "يتم تعليق ارباح الأكاديميين لمدة 14 يوم كاملين اي ما يعادل 336 ساعة على الاقل للسماح لصاحب المشروع بإختبار وتقييم العمل المقدم."
        },
        {
            title: "التواصل",
            content: "لا يجوز وضع اي وسائل تواصل خارجية في اي جزء من حسابك الشخصي او ما يتعلق به سواءً بشكل مباشر او غير مباشر."
        },
        {
            title: "حقوق الملكية الفكرية",
            content: "بشكل افتراضي، وما لم يتم الاتفاق من قبل بداية المشروع على عكس ذلك، يمتلك صاحب المشروع كامل حقوق الملكية الفكرية وحقوق التأليف والنشر للمشاريع التي استلمها من خلال بارق."
        }
    ];

    return (
        <div className="container mx-auto px-4 py-8 text-right">
            <div>
                <BackLink href="/">العودة للرئيسية</BackLink>
            </div>

            <PageTitle title="الشروط والأحكام " />
            <div className="w-full space-y-8">
                {terms.map((term, index) => (
                    <div key={index} className="bg-white rounded-lg shadow-md p-6 ">
                        <h2 className="text-xl font-semibold mb-4">{term.title}</h2>
                        <p className="text-label leading-relaxed">{term.content}</p>
                    </div>
                ))}

                <div className="mt-8 text-center">
                    <p className="text-label">
                        آخر تحديث للشروط والأحكام: أكتوبر 2025
                    </p>
                </div>
            </div>
        </div>
    );
}
